Oryx-Embedded/CycloneTCP/drivers/mac/f2838x_eth_driver.h
/**
 * @file f2838x_eth_driver.h
 * @brief TMS320F2838xD Ethernet MAC driver
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

#ifndef _F2838X_ETH_DRIVER_H
#define _F2838X_ETH_DRIVER_H

//Dependencies
#include "core/nic.h"

//Number of TX buffers
#ifndef F2838X_ETH_TX_BUFFER_COUNT
   #define F2838X_ETH_TX_BUFFER_COUNT 2
#elif (F2838X_ETH_TX_BUFFER_COUNT < 1)
   #error F2838X_ETH_TX_BUFFER_COUNT parameter is not valid
#endif

//TX buffer size
#ifndef F2838X_ETH_TX_BUFFER_SIZE
   #define F2838X_ETH_TX_BUFFER_SIZE 1536
#elif (F2838X_ETH_TX_BUFFER_SIZE != 1536)
   #error F2838X_ETH_TX_BUFFER_SIZE parameter is not valid
#endif

//Number of RX buffers
#ifndef F2838X_ETH_RX_BUFFER_COUNT
   #define F2838X_ETH_RX_BUFFER_COUNT 4
#elif (F2838X_ETH_RX_BUFFER_COUNT < 1)
   #error F2838X_ETH_RX_BUFFER_COUNT parameter is not valid
#endif

//RX buffer size
#ifndef F2838X_ETH_RX_BUFFER_SIZE
   #define F2838X_ETH_RX_BUFFER_SIZE 1536
#elif (F2838X_ETH_RX_BUFFER_SIZE != 1536)
   #error F2838X_ETH_RX_BUFFER_SIZE parameter is not valid
#endif

//Ethernet interrupt priority
#ifndef F2838X_ETH_IRQ_PRIORITY
   #define F2838X_ETH_IRQ_PRIORITY 6
#elif (F2838X_ETH_IRQ_PRIORITY < 0)
   #error F2838X_ETH_IRQ_PRIORITY parameter is not valid
#endif

//EMAC registers
#define ETHERNET_MAC_CONFIGURATION_R                     HWREG(EMAC_BASE + ETHERNET_O_MAC_CONFIGURATION)
#define ETHERNET_MAC_EXT_CONFIGURATION_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_EXT_CONFIGURATION)
#define ETHERNET_MAC_PACKET_FILTER_R                     HWREG(EMAC_BASE + ETHERNET_O_MAC_PACKET_FILTER)
#define ETHERNET_MAC_WATCHDOG_TIMEOUT_R                  HWREG(EMAC_BASE + ETHERNET_O_MAC_WATCHDOG_TIMEOUT)
#define ETHERNET_MAC_HASH_TABLE_REG0_R                   HWREG(EMAC_BASE + ETHERNET_O_MAC_HASH_TABLE_REG0)
#define ETHERNET_MAC_HASH_TABLE_REG1_R                   HWREG(EMAC_BASE + ETHERNET_O_MAC_HASH_TABLE_REG1)
#define ETHERNET_MAC_VLAN_TAG_CTRL_R                     HWREG(EMAC_BASE + ETHERNET_O_MAC_VLAN_TAG_CTRL)
#define ETHERNET_MAC_VLAN_TAG_DATA_R                     HWREG(EMAC_BASE + ETHERNET_O_MAC_VLAN_TAG_DATA)
#define ETHERNET_MAC_VLAN_HASH_TABLE_R                   HWREG(EMAC_BASE + ETHERNET_O_MAC_VLAN_HASH_TABLE)
#define ETHERNET_MAC_VLAN_INCL_R                         HWREG(EMAC_BASE + ETHERNET_O_MAC_VLAN_INCL)
#define ETHERNET_MAC_INNER_VLAN_INCL_R                   HWREG(EMAC_BASE + ETHERNET_O_MAC_INNER_VLAN_INCL)
#define ETHERNET_MAC_Q0_TX_FLOW_CTRL_R                   HWREG(EMAC_BASE + ETHERNET_O_MAC_Q0_TX_FLOW_CTRL)
#define ETHERNET_MAC_RX_FLOW_CTRL_R                      HWREG(EMAC_BASE + ETHERNET_O_MAC_RX_FLOW_CTRL)
#define ETHERNET_MAC_RXQ_CTRL4_R                         HWREG(EMAC_BASE + ETHERNET_O_MAC_RXQ_CTRL4)
#define ETHERNET_MAC_RXQ_CTRL0_R                         HWREG(EMAC_BASE + ETHERNET_O_MAC_RXQ_CTRL0)
#define ETHERNET_MAC_RXQ_CTRL1_R                         HWREG(EMAC_BASE + ETHERNET_O_MAC_RXQ_CTRL1)
#define ETHERNET_MAC_RXQ_CTRL2_R                         HWREG(EMAC_BASE + ETHERNET_O_MAC_RXQ_CTRL2)
#define ETHERNET_MAC_INTERRUPT_STATUS_R                  HWREG(EMAC_BASE + ETHERNET_O_MAC_INTERRUPT_STATUS)
#define ETHERNET_MAC_INTERRUPT_ENABLE_R                  HWREG(EMAC_BASE + ETHERNET_O_MAC_INTERRUPT_ENABLE)
#define ETHERNET_MAC_RX_TX_STATUS_R                      HWREG(EMAC_BASE + ETHERNET_O_MAC_RX_TX_STATUS)
#define ETHERNET_MAC_PMT_CONTROL_STATUS_R                HWREG(EMAC_BASE + ETHERNET_O_MAC_PMT_CONTROL_STATUS)
#define ETHERNET_MAC_RWK_PACKET_FILTER_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_RWK_PACKET_FILTER)
#define ETHERNET_MAC_LPI_CONTROL_STATUS_R                HWREG(EMAC_BASE + ETHERNET_O_MAC_LPI_CONTROL_STATUS)
#define ETHERNET_MAC_LPI_TIMERS_CONTROL_R                HWREG(EMAC_BASE + ETHERNET_O_MAC_LPI_TIMERS_CONTROL)
#define ETHERNET_MAC_LPI_ENTRY_TIMER_R                   HWREG(EMAC_BASE + ETHERNET_O_MAC_LPI_ENTRY_TIMER)
#define ETHERNET_MAC_1US_TIC_COUNTER_R                   HWREG(EMAC_BASE + ETHERNET_O_MAC_1US_TIC_COUNTER)
#define ETHERNET_MAC_VERSION_R                           HWREG(EMAC_BASE + ETHERNET_O_MAC_VERSION)
#define ETHERNET_MAC_DEBUG_R                             HWREG(EMAC_BASE + ETHERNET_O_MAC_DEBUG)
#define ETHERNET_MAC_HW_FEATURE0_R                       HWREG(EMAC_BASE + ETHERNET_O_MAC_HW_FEATURE0)
#define ETHERNET_MAC_HW_FEATURE1_R                       HWREG(EMAC_BASE + ETHERNET_O_MAC_HW_FEATURE1)
#define ETHERNET_MAC_HW_FEATURE2_R                       HWREG(EMAC_BASE + ETHERNET_O_MAC_HW_FEATURE2)
#define ETHERNET_MAC_HW_FEATURE3_R                       HWREG(EMAC_BASE + ETHERNET_O_MAC_HW_FEATURE3)
#define ETHERNET_MAC_MDIO_ADDRESS_R                      HWREG(EMAC_BASE + ETHERNET_O_MAC_MDIO_ADDRESS)
#define ETHERNET_MAC_MDIO_DATA_R                         HWREG(EMAC_BASE + ETHERNET_O_MAC_MDIO_DATA)
#define ETHERNET_MAC_ARP_ADDRESS_R                       HWREG(EMAC_BASE + ETHERNET_O_MAC_ARP_ADDRESS)
#define ETHERNET_MAC_ADDRESS0_HIGH_R                     HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS0_HIGH)
#define ETHERNET_MAC_ADDRESS0_LOW_R                      HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS0_LOW)
#define ETHERNET_MAC_ADDRESS1_HIGH_R                     HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS1_HIGH)
#define ETHERNET_MAC_ADDRESS1_LOW_R                      HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS1_LOW)
#define ETHERNET_MAC_ADDRESS2_HIGH_R                     HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS2_HIGH)
#define ETHERNET_MAC_ADDRESS2_LOW_R                      HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS2_LOW)
#define ETHERNET_MAC_ADDRESS3_HIGH_R                     HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS3_HIGH)
#define ETHERNET_MAC_ADDRESS3_LOW_R                      HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS3_LOW)
#define ETHERNET_MAC_ADDRESS4_HIGH_R                     HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS4_HIGH)
#define ETHERNET_MAC_ADDRESS4_LOW_R                      HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS4_LOW)
#define ETHERNET_MAC_ADDRESS5_HIGH_R                     HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS5_HIGH)
#define ETHERNET_MAC_ADDRESS5_LOW_R                      HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS5_LOW)
#define ETHERNET_MAC_ADDRESS6_HIGH_R                     HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS6_HIGH)
#define ETHERNET_MAC_ADDRESS6_LOW_R                      HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS6_LOW)
#define ETHERNET_MAC_ADDRESS7_HIGH_R                     HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS7_HIGH)
#define ETHERNET_MAC_ADDRESS7_LOW_R                      HWREG(EMAC_BASE + ETHERNET_O_MAC_ADDRESS7_LOW)
#define ETHERNET_MMC_CONTROL_R                           HWREG(EMAC_BASE + ETHERNET_O_MMC_CONTROL)
#define ETHERNET_MMC_RX_INTERRUPT_R                      HWREG(EMAC_BASE + ETHERNET_O_MMC_RX_INTERRUPT)
#define ETHERNET_MMC_TX_INTERRUPT_R                      HWREG(EMAC_BASE + ETHERNET_O_MMC_TX_INTERRUPT)
#define ETHERNET_MMC_RX_INTERRUPT_MASK_R                 HWREG(EMAC_BASE + ETHERNET_O_MMC_RX_INTERRUPT_MASK)
#define ETHERNET_MMC_TX_INTERRUPT_MASK_R                 HWREG(EMAC_BASE + ETHERNET_O_MMC_TX_INTERRUPT_MASK)
#define ETHERNET_TX_OCTET_COUNT_GOOD_BAD_R               HWREG(EMAC_BASE + ETHERNET_O_TX_OCTET_COUNT_GOOD_BAD)
#define ETHERNET_TX_PACKET_COUNT_GOOD_BAD_R              HWREG(EMAC_BASE + ETHERNET_O_TX_PACKET_COUNT_GOOD_BAD)
#define ETHERNET_TX_BROADCAST_PACKETS_GOOD_R             HWREG(EMAC_BASE + ETHERNET_O_TX_BROADCAST_PACKETS_GOOD)
#define ETHERNET_TX_MULTICAST_PACKETS_GOOD_R             HWREG(EMAC_BASE + ETHERNET_O_TX_MULTICAST_PACKETS_GOOD)
#define ETHERNET_TX_64OCTETS_PACKETS_GOOD_BAD_R          HWREG(EMAC_BASE + ETHERNET_O_TX_64OCTETS_PACKETS_GOOD_BAD)
#define ETHERNET_TX_65TO127OCTETS_PACKETS_GOOD_BAD_R     HWREG(EMAC_BASE + ETHERNET_O_TX_65TO127OCTETS_PACKETS_GOOD_BAD)
#define ETHERNET_TX_128TO255OCTETS_PACKETS_GOOD_BAD_R    HWREG(EMAC_BASE + ETHERNET_O_TX_128TO255OCTETS_PACKETS_GOOD_BAD)
#define ETHERNET_TX_256TO511OCTETS_PACKETS_GOOD_BAD_R    HWREG(EMAC_BASE + ETHERNET_O_TX_256TO511OCTETS_PACKETS_GOOD_BAD)
#define ETHERNET_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_R   HWREG(EMAC_BASE + ETHERNET_O_TX_512TO1023OCTETS_PACKETS_GOOD_BAD)
#define ETHERNET_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_R   HWREG(EMAC_BASE + ETHERNET_O_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD)
#define ETHERNET_TX_UNICAST_PACKETS_GOOD_BAD_R           HWREG(EMAC_BASE + ETHERNET_O_TX_UNICAST_PACKETS_GOOD_BAD)
#define ETHERNET_TX_MULTICAST_PACKETS_GOOD_BAD_R         HWREG(EMAC_BASE + ETHERNET_O_TX_MULTICAST_PACKETS_GOOD_BAD)
#define ETHERNET_TX_BROADCAST_PACKETS_GOOD_BAD_R         HWREG(EMAC_BASE + ETHERNET_O_TX_BROADCAST_PACKETS_GOOD_BAD)
#define ETHERNET_TX_UNDERFLOW_ERROR_PACKETS_R            HWREG(EMAC_BASE + ETHERNET_O_TX_UNDERFLOW_ERROR_PACKETS)
#define ETHERNET_TX_SINGLE_COLLISION_GOOD_PACKETS_R      HWREG(EMAC_BASE + ETHERNET_O_TX_SINGLE_COLLISION_GOOD_PACKETS)
#define ETHERNET_TX_MULTIPLE_COLLISION_GOOD_PACKETS_R    HWREG(EMAC_BASE + ETHERNET_O_TX_MULTIPLE_COLLISION_GOOD_PACKETS)
#define ETHERNET_TX_DEFERRED_PACKETS_R                   HWREG(EMAC_BASE + ETHERNET_O_TX_DEFERRED_PACKETS)
#define ETHERNET_TX_LATE_COLLISION_PACKETS_R             HWREG(EMAC_BASE + ETHERNET_O_TX_LATE_COLLISION_PACKETS)
#define ETHERNET_TX_EXCESSIVE_COLLISION_PACKETS_R        HWREG(EMAC_BASE + ETHERNET_O_TX_EXCESSIVE_COLLISION_PACKETS)
#define ETHERNET_TX_CARRIER_ERROR_PACKETS_R              HWREG(EMAC_BASE + ETHERNET_O_TX_CARRIER_ERROR_PACKETS)
#define ETHERNET_TX_OCTET_COUNT_GOOD_R                   HWREG(EMAC_BASE + ETHERNET_O_TX_OCTET_COUNT_GOOD)
#define ETHERNET_TX_PACKET_COUNT_GOOD_R                  HWREG(EMAC_BASE + ETHERNET_O_TX_PACKET_COUNT_GOOD)
#define ETHERNET_TX_EXCESSIVE_DEFERRAL_ERROR_R           HWREG(EMAC_BASE + ETHERNET_O_TX_EXCESSIVE_DEFERRAL_ERROR)
#define ETHERNET_TX_PAUSE_PACKETS_R                      HWREG(EMAC_BASE + ETHERNET_O_TX_PAUSE_PACKETS)
#define ETHERNET_TX_VLAN_PACKETS_GOOD_R                  HWREG(EMAC_BASE + ETHERNET_O_TX_VLAN_PACKETS_GOOD)
#define ETHERNET_TX_OSIZE_PACKETS_GOOD_R                 HWREG(EMAC_BASE + ETHERNET_O_TX_OSIZE_PACKETS_GOOD)
#define ETHERNET_RX_PACKETS_COUNT_GOOD_BAD_R             HWREG(EMAC_BASE + ETHERNET_O_RX_PACKETS_COUNT_GOOD_BAD)
#define ETHERNET_RX_OCTET_COUNT_GOOD_BAD_R               HWREG(EMAC_BASE + ETHERNET_O_RX_OCTET_COUNT_GOOD_BAD)
#define ETHERNET_RX_OCTET_COUNT_GOOD_R                   HWREG(EMAC_BASE + ETHERNET_O_RX_OCTET_COUNT_GOOD)
#define ETHERNET_RX_BROADCAST_PACKETS_GOOD_R             HWREG(EMAC_BASE + ETHERNET_O_RX_BROADCAST_PACKETS_GOOD)
#define ETHERNET_RX_MULTICAST_PACKETS_GOOD_R             HWREG(EMAC_BASE + ETHERNET_O_RX_MULTICAST_PACKETS_GOOD)
#define ETHERNET_RX_CRC_ERROR_PACKETS_R                  HWREG(EMAC_BASE + ETHERNET_O_RX_CRC_ERROR_PACKETS)
#define ETHERNET_RX_ALIGNMENT_ERROR_PACKETS_R            HWREG(EMAC_BASE + ETHERNET_O_RX_ALIGNMENT_ERROR_PACKETS)
#define ETHERNET_RX_RUNT_ERROR_PACKETS_R                 HWREG(EMAC_BASE + ETHERNET_O_RX_RUNT_ERROR_PACKETS)
#define ETHERNET_RX_JABBER_ERROR_PACKETS_R               HWREG(EMAC_BASE + ETHERNET_O_RX_JABBER_ERROR_PACKETS)
#define ETHERNET_RX_UNDERSIZE_PACKETS_GOOD_R             HWREG(EMAC_BASE + ETHERNET_O_RX_UNDERSIZE_PACKETS_GOOD)
#define ETHERNET_RX_OVERSIZE_PACKETS_GOOD_R              HWREG(EMAC_BASE + ETHERNET_O_RX_OVERSIZE_PACKETS_GOOD)
#define ETHERNET_RX_64OCTETS_PACKETS_GOOD_BAD_R          HWREG(EMAC_BASE + ETHERNET_O_RX_64OCTETS_PACKETS_GOOD_BAD)
#define ETHERNET_RX_65TO127OCTETS_PACKETS_GOOD_BAD_R     HWREG(EMAC_BASE + ETHERNET_O_RX_65TO127OCTETS_PACKETS_GOOD_BAD)
#define ETHERNET_RX_128TO255OCTETS_PACKETS_GOOD_BAD_R    HWREG(EMAC_BASE + ETHERNET_O_RX_128TO255OCTETS_PACKETS_GOOD_BAD)
#define ETHERNET_RX_256TO511OCTETS_PACKETS_GOOD_BAD_R    HWREG(EMAC_BASE + ETHERNET_O_RX_256TO511OCTETS_PACKETS_GOOD_BAD)
#define ETHERNET_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_R   HWREG(EMAC_BASE + ETHERNET_O_RX_512TO1023OCTETS_PACKETS_GOOD_BAD)
#define ETHERNET_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_R   HWREG(EMAC_BASE + ETHERNET_O_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD)
#define ETHERNET_RX_UNICAST_PACKETS_GOOD_R               HWREG(EMAC_BASE + ETHERNET_O_RX_UNICAST_PACKETS_GOOD)
#define ETHERNET_RX_LENGTH_ERROR_PACKETS_R               HWREG(EMAC_BASE + ETHERNET_O_RX_LENGTH_ERROR_PACKETS)
#define ETHERNET_RX_OUT_OF_RANGE_TYPE_PACKETS_R          HWREG(EMAC_BASE + ETHERNET_O_RX_OUT_OF_RANGE_TYPE_PACKETS)
#define ETHERNET_RX_PAUSE_PACKETS_R                      HWREG(EMAC_BASE + ETHERNET_O_RX_PAUSE_PACKETS)
#define ETHERNET_RX_FIFO_OVERFLOW_PACKETS_R              HWREG(EMAC_BASE + ETHERNET_O_RX_FIFO_OVERFLOW_PACKETS)
#define ETHERNET_RX_VLAN_PACKETS_GOOD_BAD_R              HWREG(EMAC_BASE + ETHERNET_O_RX_VLAN_PACKETS_GOOD_BAD)
#define ETHERNET_RX_WATCHDOG_ERROR_PACKETS_R             HWREG(EMAC_BASE + ETHERNET_O_RX_WATCHDOG_ERROR_PACKETS)
#define ETHERNET_RX_RECEIVE_ERROR_PACKETS_R              HWREG(EMAC_BASE + ETHERNET_O_RX_RECEIVE_ERROR_PACKETS)
#define ETHERNET_RX_CONTROL_PACKETS_GOOD_R               HWREG(EMAC_BASE + ETHERNET_O_RX_CONTROL_PACKETS_GOOD)
#define ETHERNET_TX_LPI_USEC_CNTR_R                      HWREG(EMAC_BASE + ETHERNET_O_TX_LPI_USEC_CNTR)
#define ETHERNET_TX_LPI_TRAN_CNTR_R                      HWREG(EMAC_BASE + ETHERNET_O_TX_LPI_TRAN_CNTR)
#define ETHERNET_RX_LPI_USEC_CNTR_R                      HWREG(EMAC_BASE + ETHERNET_O_RX_LPI_USEC_CNTR)
#define ETHERNET_RX_LPI_TRAN_CNTR_R                      HWREG(EMAC_BASE + ETHERNET_O_RX_LPI_TRAN_CNTR)
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_R             HWREG(EMAC_BASE + ETHERNET_O_MMC_IPC_RX_INTERRUPT_MASK)
#define ETHERNET_MMC_IPC_RX_INTERRUPT_R                  HWREG(EMAC_BASE + ETHERNET_O_MMC_IPC_RX_INTERRUPT)
#define ETHERNET_RXIPV4_GOOD_PACKETS_R                   HWREG(EMAC_BASE + ETHERNET_O_RXIPV4_GOOD_PACKETS)
#define ETHERNET_RXIPV4_HEADER_ERROR_PACKETS_R           HWREG(EMAC_BASE + ETHERNET_O_RXIPV4_HEADER_ERROR_PACKETS)
#define ETHERNET_RXIPV4_NO_PAYLOAD_PACKETS_R             HWREG(EMAC_BASE + ETHERNET_O_RXIPV4_NO_PAYLOAD_PACKETS)
#define ETHERNET_RXIPV4_FRAGMENTED_PACKETS_R             HWREG(EMAC_BASE + ETHERNET_O_RXIPV4_FRAGMENTED_PACKETS)
#define ETHERNET_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS_R  HWREG(EMAC_BASE + ETHERNET_O_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS)
#define ETHERNET_RXIPV6_GOOD_PACKETS_R                   HWREG(EMAC_BASE + ETHERNET_O_RXIPV6_GOOD_PACKETS)
#define ETHERNET_RXIPV6_HEADER_ERROR_PACKETS_R           HWREG(EMAC_BASE + ETHERNET_O_RXIPV6_HEADER_ERROR_PACKETS)
#define ETHERNET_RXIPV6_NO_PAYLOAD_PACKETS_R             HWREG(EMAC_BASE + ETHERNET_O_RXIPV6_NO_PAYLOAD_PACKETS)
#define ETHERNET_RXUDP_GOOD_PACKETS_R                    HWREG(EMAC_BASE + ETHERNET_O_RXUDP_GOOD_PACKETS)
#define ETHERNET_RXUDP_ERROR_PACKETS_R                   HWREG(EMAC_BASE + ETHERNET_O_RXUDP_ERROR_PACKETS)
#define ETHERNET_RXTCP_GOOD_PACKETS_R                    HWREG(EMAC_BASE + ETHERNET_O_RXTCP_GOOD_PACKETS)
#define ETHERNET_RXTCP_ERROR_PACKETS_R                   HWREG(EMAC_BASE + ETHERNET_O_RXTCP_ERROR_PACKETS)
#define ETHERNET_RXICMP_GOOD_PACKETS_R                   HWREG(EMAC_BASE + ETHERNET_O_RXICMP_GOOD_PACKETS)
#define ETHERNET_RXICMP_ERROR_PACKETS_R                  HWREG(EMAC_BASE + ETHERNET_O_RXICMP_ERROR_PACKETS)
#define ETHERNET_RXIPV4_GOOD_OCTETS_R                    HWREG(EMAC_BASE + ETHERNET_O_RXIPV4_GOOD_OCTETS)
#define ETHERNET_RXIPV4_HEADER_ERROR_OCTETS_R            HWREG(EMAC_BASE + ETHERNET_O_RXIPV4_HEADER_ERROR_OCTETS)
#define ETHERNET_RXIPV4_NO_PAYLOAD_OCTETS_R              HWREG(EMAC_BASE + ETHERNET_O_RXIPV4_NO_PAYLOAD_OCTETS)
#define ETHERNET_RXIPV4_FRAGMENTED_OCTETS_R              HWREG(EMAC_BASE + ETHERNET_O_RXIPV4_FRAGMENTED_OCTETS)
#define ETHERNET_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_R    HWREG(EMAC_BASE + ETHERNET_O_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS)
#define ETHERNET_RXIPV6_GOOD_OCTETS_R                    HWREG(EMAC_BASE + ETHERNET_O_RXIPV6_GOOD_OCTETS)
#define ETHERNET_RXIPV6_HEADER_ERROR_OCTETS_R            HWREG(EMAC_BASE + ETHERNET_O_RXIPV6_HEADER_ERROR_OCTETS)
#define ETHERNET_RXIPV6_NO_PAYLOAD_OCTETS_R              HWREG(EMAC_BASE + ETHERNET_O_RXIPV6_NO_PAYLOAD_OCTETS)
#define ETHERNET_RXUDP_GOOD_OCTETS_R                     HWREG(EMAC_BASE + ETHERNET_O_RXUDP_GOOD_OCTETS)
#define ETHERNET_RXUDP_ERROR_OCTETS_R                    HWREG(EMAC_BASE + ETHERNET_O_RXUDP_ERROR_OCTETS)
#define ETHERNET_RXTCP_GOOD_OCTETS_R                     HWREG(EMAC_BASE + ETHERNET_O_RXTCP_GOOD_OCTETS)
#define ETHERNET_RXTCP_ERROR_OCTETS_R                    HWREG(EMAC_BASE + ETHERNET_O_RXTCP_ERROR_OCTETS)
#define ETHERNET_RXICMP_GOOD_OCTETS_R                    HWREG(EMAC_BASE + ETHERNET_O_RXICMP_GOOD_OCTETS)
#define ETHERNET_RXICMP_ERROR_OCTETS_R                   HWREG(EMAC_BASE + ETHERNET_O_RXICMP_ERROR_OCTETS)
#define ETHERNET_MAC_L3_L4_CONTROL0_R                    HWREG(EMAC_BASE + ETHERNET_O_MAC_L3_L4_CONTROL0)
#define ETHERNET_MAC_LAYER4_ADDRESS0_R                   HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER4_ADDRESS0)
#define ETHERNET_MAC_LAYER3_ADDR0_REG0_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR0_REG0)
#define ETHERNET_MAC_LAYER3_ADDR1_REG0_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR1_REG0)
#define ETHERNET_MAC_LAYER3_ADDR2_REG0_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR2_REG0)
#define ETHERNET_MAC_LAYER3_ADDR3_REG0_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR3_REG0)
#define ETHERNET_MAC_L3_L4_CONTROL1_R                    HWREG(EMAC_BASE + ETHERNET_O_MAC_L3_L4_CONTROL1)
#define ETHERNET_MAC_LAYER4_ADDRESS1_R                   HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER4_ADDRESS1)
#define ETHERNET_MAC_LAYER3_ADDR0_REG1_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR0_REG1)
#define ETHERNET_MAC_LAYER3_ADDR1_REG1_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR1_REG1)
#define ETHERNET_MAC_LAYER3_ADDR2_REG1_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR2_REG1)
#define ETHERNET_MAC_LAYER3_ADDR3_REG1_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR3_REG1)
#define ETHERNET_MAC_L3_L4_CONTROL2_R                    HWREG(EMAC_BASE + ETHERNET_O_MAC_L3_L4_CONTROL2)
#define ETHERNET_MAC_LAYER4_ADDRESS2_R                   HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER4_ADDRESS2)
#define ETHERNET_MAC_LAYER3_ADDR0_REG2_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR0_REG2)
#define ETHERNET_MAC_LAYER3_ADDR1_REG2_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR1_REG2)
#define ETHERNET_MAC_LAYER3_ADDR2_REG2_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR2_REG2)
#define ETHERNET_MAC_LAYER3_ADDR3_REG2_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR3_REG2)
#define ETHERNET_MAC_L3_L4_CONTROL3_R                    HWREG(EMAC_BASE + ETHERNET_O_MAC_L3_L4_CONTROL3)
#define ETHERNET_MAC_LAYER4_ADDRESS3_R                   HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER4_ADDRESS3)
#define ETHERNET_MAC_LAYER3_ADDR0_REG3_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR0_REG3)
#define ETHERNET_MAC_LAYER3_ADDR1_REG3_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR1_REG3)
#define ETHERNET_MAC_LAYER3_ADDR2_REG3_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR2_REG3)
#define ETHERNET_MAC_LAYER3_ADDR3_REG3_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_LAYER3_ADDR3_REG3)
#define ETHERNET_MAC_TIMESTAMP_CONTROL_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_TIMESTAMP_CONTROL)
#define ETHERNET_MAC_SUB_SECOND_INCREMENT_R              HWREG(EMAC_BASE + ETHERNET_O_MAC_SUB_SECOND_INCREMENT)
#define ETHERNET_MAC_SYSTEM_TIME_SECONDS_R               HWREG(EMAC_BASE + ETHERNET_O_MAC_SYSTEM_TIME_SECONDS)
#define ETHERNET_MAC_SYSTEM_TIME_NANOSECONDS_R           HWREG(EMAC_BASE + ETHERNET_O_MAC_SYSTEM_TIME_NANOSECONDS)
#define ETHERNET_MAC_SYSTEM_TIME_SECONDS_UPDATE_R        HWREG(EMAC_BASE + ETHERNET_O_MAC_SYSTEM_TIME_SECONDS_UPDATE)
#define ETHERNET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_R    HWREG(EMAC_BASE + ETHERNET_O_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE)
#define ETHERNET_MAC_TIMESTAMP_ADDEND_R                  HWREG(EMAC_BASE + ETHERNET_O_MAC_TIMESTAMP_ADDEND)
#define ETHERNET_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_R   HWREG(EMAC_BASE + ETHERNET_O_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS)
#define ETHERNET_MAC_TIMESTAMP_STATUS_R                  HWREG(EMAC_BASE + ETHERNET_O_MAC_TIMESTAMP_STATUS)
#define ETHERNET_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_R   HWREG(EMAC_BASE + ETHERNET_O_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS)
#define ETHERNET_MAC_TX_TIMESTAMP_STATUS_SECONDS_R       HWREG(EMAC_BASE + ETHERNET_O_MAC_TX_TIMESTAMP_STATUS_SECONDS)
#define ETHERNET_MAC_AUXILIARY_CONTROL_R                 HWREG(EMAC_BASE + ETHERNET_O_MAC_AUXILIARY_CONTROL)
#define ETHERNET_MAC_AUXILIARY_TIMESTAMP_NANOSECONDS_R   HWREG(EMAC_BASE + ETHERNET_O_MAC_AUXILIARY_TIMESTAMP_NANOSECONDS)
#define ETHERNET_MAC_AUXILIARY_TIMESTAMP_SECONDS_R       HWREG(EMAC_BASE + ETHERNET_O_MAC_AUXILIARY_TIMESTAMP_SECONDS)
#define ETHERNET_MAC_TIMESTAMP_INGRESS_ASYM_CORR_R       HWREG(EMAC_BASE + ETHERNET_O_MAC_TIMESTAMP_INGRESS_ASYM_CORR)
#define ETHERNET_MAC_TIMESTAMP_EGRESS_ASYM_CORR_R        HWREG(EMAC_BASE + ETHERNET_O_MAC_TIMESTAMP_EGRESS_ASYM_CORR)
#define ETHERNET_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_R HWREG(EMAC_BASE + ETHERNET_O_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND)
#define ETHERNET_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_R  HWREG(EMAC_BASE + ETHERNET_O_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND)
#define ETHERNET_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_R HWREG(EMAC_BASE + ETHERNET_O_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC)
#define ETHERNET_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_R  HWREG(EMAC_BASE + ETHERNET_O_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC)
#define ETHERNET_MAC_PPS_CONTROL_R                       HWREG(EMAC_BASE + ETHERNET_O_MAC_PPS_CONTROL)
#define ETHERNET_MAC_PTO_CONTROL_R                       HWREG(EMAC_BASE + ETHERNET_O_MAC_PTO_CONTROL)
#define ETHERNET_MAC_SOURCE_PORT_IDENTITY0_R             HWREG(EMAC_BASE + ETHERNET_O_MAC_SOURCE_PORT_IDENTITY0)
#define ETHERNET_MAC_SOURCE_PORT_IDENTITY1_R             HWREG(EMAC_BASE + ETHERNET_O_MAC_SOURCE_PORT_IDENTITY1)
#define ETHERNET_MAC_SOURCE_PORT_IDENTITY2_R             HWREG(EMAC_BASE + ETHERNET_O_MAC_SOURCE_PORT_IDENTITY2)
#define ETHERNET_MAC_LOG_MESSAGE_INTERVAL_R              HWREG(EMAC_BASE + ETHERNET_O_MAC_LOG_MESSAGE_INTERVAL)
#define ETHERNET_DMA_MODE_R                              HWREG(EMAC_BASE + ETHERNET_O_DMA_MODE)
#define ETHERNET_DMA_SYSBUS_MODE_R                       HWREG(EMAC_BASE + ETHERNET_O_DMA_SYSBUS_MODE)
#define ETHERNET_DMA_INTERRUPT_STATUS_R                  HWREG(EMAC_BASE + ETHERNET_O_DMA_INTERRUPT_STATUS)
#define ETHERNET_DMA_DEBUG_STATUS0_R                     HWREG(EMAC_BASE + ETHERNET_O_DMA_DEBUG_STATUS0)
#define ETHERNET_DMA_CH0_CONTROL_R                       HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_CONTROL)
#define ETHERNET_DMA_CH0_TX_CONTROL_R                    HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_TX_CONTROL)
