Oryx-Embedded/CycloneTCP/drivers/mac/f2838x_eth_driver.h
#define ETHERNET_DMA_CH0_RX_CONTROL_R                    HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_RX_CONTROL)
#define ETHERNET_DMA_CH0_TXDESC_LIST_ADDRESS_R           HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_TXDESC_LIST_ADDRESS)
#define ETHERNET_DMA_CH0_RXDESC_LIST_ADDRESS_R           HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_RXDESC_LIST_ADDRESS)
#define ETHERNET_DMA_CH0_TXDESC_TAIL_POINTER_R           HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_TXDESC_TAIL_POINTER)
#define ETHERNET_DMA_CH0_RXDESC_TAIL_POINTER_R           HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_RXDESC_TAIL_POINTER)
#define ETHERNET_DMA_CH0_TXDESC_RING_LENGTH_R            HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_TXDESC_RING_LENGTH)
#define ETHERNET_DMA_CH0_RXDESC_RING_LENGTH_R            HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_RXDESC_RING_LENGTH)
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_R              HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_INTERRUPT_ENABLE)
#define ETHERNET_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_R   HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER)
#define ETHERNET_DMA_CH0_CURRENT_APP_TXDESC_R            HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_CURRENT_APP_TXDESC)
#define ETHERNET_DMA_CH0_CURRENT_APP_RXDESC_R            HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_CURRENT_APP_RXDESC)
#define ETHERNET_DMA_CH0_CURRENT_APP_TXBUFFER_R          HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_CURRENT_APP_TXBUFFER)
#define ETHERNET_DMA_CH0_CURRENT_APP_RXBUFFER_R          HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_CURRENT_APP_RXBUFFER)
#define ETHERNET_DMA_CH0_STATUS_R                        HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_STATUS)
#define ETHERNET_DMA_CH0_MISS_FRAME_CNT_R                HWREG(EMAC_BASE + ETHERNET_O_DMA_CH0_MISS_FRAME_CNT)
#define ETHERNET_DMA_CH1_CONTROL_R                       HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_CONTROL)
#define ETHERNET_DMA_CH1_TX_CONTROL_R                    HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_TX_CONTROL)
#define ETHERNET_DMA_CH1_RX_CONTROL_R                    HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_RX_CONTROL)
#define ETHERNET_DMA_CH1_TXDESC_LIST_ADDRESS_R           HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_TXDESC_LIST_ADDRESS)
#define ETHERNET_DMA_CH1_RXDESC_LIST_ADDRESS_R           HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_RXDESC_LIST_ADDRESS)
#define ETHERNET_DMA_CH1_TXDESC_TAIL_POINTER_R           HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_TXDESC_TAIL_POINTER)
#define ETHERNET_DMA_CH1_RXDESC_TAIL_POINTER_R           HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_RXDESC_TAIL_POINTER)
#define ETHERNET_DMA_CH1_TXDESC_RING_LENGTH_R            HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_TXDESC_RING_LENGTH)
#define ETHERNET_DMA_CH1_RXDESC_RING_LENGTH_R            HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_RXDESC_RING_LENGTH)
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_R              HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_INTERRUPT_ENABLE)
#define ETHERNET_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_R   HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER)
#define ETHERNET_DMA_CH1_CURRENT_APP_TXDESC_R            HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_CURRENT_APP_TXDESC)
#define ETHERNET_DMA_CH1_CURRENT_APP_RXDESC_R            HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_CURRENT_APP_RXDESC)
#define ETHERNET_DMA_CH1_CURRENT_APP_TXBUFFER_R          HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_CURRENT_APP_TXBUFFER)
#define ETHERNET_DMA_CH1_CURRENT_APP_RXBUFFER_R          HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_CURRENT_APP_RXBUFFER)
#define ETHERNET_DMA_CH1_STATUS_R                        HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_STATUS)
#define ETHERNET_DMA_CH1_MISS_FRAME_CNT_R                HWREG(EMAC_BASE + ETHERNET_O_DMA_CH1_MISS_FRAME_CNT)
#define ETHERNET_MTL_OPERATION_MODE_R                    HWREG(EMAC_BASE + ETHERNET_O_MTL_OPERATION_MODE)
#define ETHERNET_MTL_DBG_CTL_R                           HWREG(EMAC_BASE + ETHERNET_O_MTL_DBG_CTL)
#define ETHERNET_MTL_DBG_STS_R                           HWREG(EMAC_BASE + ETHERNET_O_MTL_DBG_STS)
#define ETHERNET_MTL_FIFO_DEBUG_DATA_R                   HWREG(EMAC_BASE + ETHERNET_O_MTL_FIFO_DEBUG_DATA)
#define ETHERNET_MTL_INTERRUPT_STATUS_R                  HWREG(EMAC_BASE + ETHERNET_O_MTL_INTERRUPT_STATUS)
#define ETHERNET_MTL_RXQ_DMA_MAP0_R                      HWREG(EMAC_BASE + ETHERNET_O_MTL_RXQ_DMA_MAP0)
#define ETHERNET_MTL_TXQ0_OPERATION_MODE_R               HWREG(EMAC_BASE + ETHERNET_O_MTL_TXQ0_OPERATION_MODE)
#define ETHERNET_MTL_TXQ0_UNDERFLOW_R                    HWREG(EMAC_BASE + ETHERNET_O_MTL_TXQ0_UNDERFLOW)
#define ETHERNET_MTL_TXQ0_DEBUG_R                        HWREG(EMAC_BASE + ETHERNET_O_MTL_TXQ0_DEBUG)
#define ETHERNET_MTL_TXQ0_ETS_STATUS_R                   HWREG(EMAC_BASE + ETHERNET_O_MTL_TXQ0_ETS_STATUS)
#define ETHERNET_MTL_TXQ0_QUANTUM_WEIGHT_R               HWREG(EMAC_BASE + ETHERNET_O_MTL_TXQ0_QUANTUM_WEIGHT)
#define ETHERNET_MTL_Q0_INTERRUPT_CONTROL_STATUS_R       HWREG(EMAC_BASE + ETHERNET_O_MTL_Q0_INTERRUPT_CONTROL_STATUS)
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_R               HWREG(EMAC_BASE + ETHERNET_O_MTL_RXQ0_OPERATION_MODE)
#define ETHERNET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_R   HWREG(EMAC_BASE + ETHERNET_O_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT)
#define ETHERNET_MTL_RXQ0_DEBUG_R                        HWREG(EMAC_BASE + ETHERNET_O_MTL_RXQ0_DEBUG)
#define ETHERNET_MTL_RXQ0_CONTROL_R                      HWREG(EMAC_BASE + ETHERNET_O_MTL_RXQ0_CONTROL)
#define ETHERNET_MTL_TXQ1_OPERATION_MODE_R               HWREG(EMAC_BASE + ETHERNET_O_MTL_TXQ1_OPERATION_MODE)
#define ETHERNET_MTL_TXQ1_UNDERFLOW_R                    HWREG(EMAC_BASE + ETHERNET_O_MTL_TXQ1_UNDERFLOW)
#define ETHERNET_MTL_TXQ1_DEBUG_R                        HWREG(EMAC_BASE + ETHERNET_O_MTL_TXQ1_DEBUG)
#define ETHERNET_MTL_TXQ1_ETS_STATUS_R                   HWREG(EMAC_BASE + ETHERNET_O_MTL_TXQ1_ETS_STATUS)
#define ETHERNET_MTL_TXQ1_QUANTUM_WEIGHT_R               HWREG(EMAC_BASE + ETHERNET_O_MTL_TXQ1_QUANTUM_WEIGHT)
#define ETHERNET_MTL_Q1_INTERRUPT_CONTROL_STATUS_R       HWREG(EMAC_BASE + ETHERNET_O_MTL_Q1_INTERRUPT_CONTROL_STATUS)
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_R               HWREG(EMAC_BASE + ETHERNET_O_MTL_RXQ1_OPERATION_MODE)
#define ETHERNET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_R   HWREG(EMAC_BASE + ETHERNET_O_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT)
#define ETHERNET_MTL_RXQ1_DEBUG_R                        HWREG(EMAC_BASE + ETHERNET_O_MTL_RXQ1_DEBUG)
#define ETHERNET_MTL_RXQ1_CONTROL_R                      HWREG(EMAC_BASE + ETHERNET_O_MTL_RXQ1_CONTROL)

