Oryx-Embedded/CycloneTCP/drivers/mac/f2838x_eth_driver.h
//EMACSS registers
#define ETHERNETSS_IPREVNUM_R                            HWREG(EMAC_SS_BASE + ETHERNETSS_O_IPREVNUM)
#define ETHERNETSS_CTRLSTS_R                             HWREG(EMAC_SS_BASE + ETHERNETSS_O_CTRLSTS)
#define ETHERNETSS_PTPTSTRIGSEL0_R                       HWREG(EMAC_SS_BASE + ETHERNETSS_O_PTPTSTRIGSEL0)
#define ETHERNETSS_PTPTSTRIGSEL1_R                       HWREG(EMAC_SS_BASE + ETHERNETSS_O_PTPTSTRIGSEL1)
#define ETHERNETSS_PTPTSSWTRIG0_R                        HWREG(EMAC_SS_BASE + ETHERNETSS_O_PTPTSSWTRIG0)
#define ETHERNETSS_PTPTSSWTRIG1_R                        HWREG(EMAC_SS_BASE + ETHERNETSS_O_PTPTSSWTRIG1)
#define ETHERNETSS_PTPPPSR0_R                            HWREG(EMAC_SS_BASE + ETHERNETSS_O_PTPPPSR0)
#define ETHERNETSS_PTPPPSR1_R                            HWREG(EMAC_SS_BASE + ETHERNETSS_O_PTPPPSR1)
#define ETHERNETSS_PTP_TSRL_R                            HWREG(EMAC_SS_BASE + ETHERNETSS_O_PTP_TSRL)
#define ETHERNETSS_PTP_TSRH_R                            HWREG(EMAC_SS_BASE + ETHERNETSS_O_PTP_TSRH)
#define ETHERNETSS_PTP_TSWL_R                            HWREG(EMAC_SS_BASE + ETHERNETSS_O_PTP_TSWL)
#define ETHERNETSS_PTP_TSWH_R                            HWREG(EMAC_SS_BASE + ETHERNETSS_O_PTP_TSWH)
#define ETHERNETSS_REVMII_CTRL_R                         HWREG(EMAC_SS_BASE + ETHERNETSS_O_REVMII_CTRL)

//Transmit normal descriptor (read format)
#define ETH_TDES0_BUF1AP        0xFFFFFFFF
#define ETH_TDES1_BUF2AP        0xFFFFFFFF
#define ETH_TDES2_IOC           0x80000000
#define ETH_TDES2_TTSE          0x40000000
#define ETH_TDES2_B2L           0x3FFF0000
#define ETH_TDES2_VTIR          0x0000C000
#define ETH_TDES2_B1L           0x00003FFF
#define ETH_TDES3_OWN           0x80000000
#define ETH_TDES3_CTXT          0x40000000
#define ETH_TDES3_FD            0x20000000
#define ETH_TDES3_LD            0x10000000
#define ETH_TDES3_CPC           0x0C000000
#define ETH_TDES3_SAIC          0x03800000
#define ETH_TDES3_THL           0x00780000
#define ETH_TDES3_TSE           0x00040000
#define ETH_TDES3_CIC           0x00030000
#define ETH_TDES3_FL            0x00007FFF

//Transmit normal descriptor (write-back format)
#define ETH_TDES0_TTSL          0xFFFFFFFF
#define ETH_TDES1_TTSH          0xFFFFFFFF
#define ETH_TDES3_OWN           0x80000000
#define ETH_TDES3_CTXT          0x40000000
#define ETH_TDES3_FD            0x20000000
#define ETH_TDES3_LD            0x10000000
#define ETH_TDES3_TTSS          0x00020000
#define ETH_TDES3_ES            0x00008000
#define ETH_TDES3_JT            0x00004000
#define ETH_TDES3_FF            0x00002000
#define ETH_TDES3_PCE           0x00001000
#define ETH_TDES3_LOC           0x00000800
#define ETH_TDES3_NC            0x00000400
#define ETH_TDES3_LC            0x00000200
#define ETH_TDES3_EC            0x00000100
#define ETH_TDES3_CC            0x000000F0
#define ETH_TDES3_ED            0x00000008
#define ETH_TDES3_UF            0x00000004
#define ETH_TDES3_DB            0x00000002
#define ETH_TDES3_IHE           0x00000001

//Transmit context descriptor
#define ETH_TDES0_TTSL          0xFFFFFFFF
#define ETH_TDES1_TTSH          0xFFFFFFFF
#define ETH_TDES2_IVT           0xFFFF0000
#define ETH_TDES2_MSS           0x00003FFF
#define ETH_TDES3_OWN           0x80000000
#define ETH_TDES3_CTXT          0x40000000
#define ETH_TDES3_OSTC          0x08000000
#define ETH_TDES3_TCMSSV        0x04000000
#define ETH_TDES3_CDE           0x00800000
#define ETH_TDES3_IVLTV         0x00020000
#define ETH_TDES3_VLTV          0x00010000
#define ETH_TDES3_VT            0x0000FFFF

//Receive normal descriptor (read format)
#define ETH_RDES0_BUF1AP        0xFFFFFFFF
#define ETH_RDES2_BUF2AP        0xFFFFFFFF
#define ETH_RDES3_OWN           0x80000000
#define ETH_RDES3_IOC           0x40000000
#define ETH_RDES3_BUF2V         0x02000000
#define ETH_RDES3_BUF1V         0x01000000

//Receive normal descriptor (write-back format)
#define ETH_RDES0_IVT           0xFFFF0000
#define ETH_RDES0_OVT           0x0000FFFF
#define ETH_RDES1_OPC           0xFFFF0000
#define ETH_RDES1_TD            0x00008000
#define ETH_RDES1_TSA           0x00004000
#define ETH_RDES1_PV            0x00002000
#define ETH_RDES1_PFT           0x00001000
#define ETH_RDES1_PMT           0x00000F00
#define ETH_RDES1_IPCE          0x00000080
#define ETH_RDES1_IPCB          0x00000040
#define ETH_RDES1_IPV6          0x00000020
#define ETH_RDES1_IPV4          0x00000010
#define ETH_RDES1_IPHE          0x00000008
#define ETH_RDES1_PT            0x00000007
#define ETH_RDES2_L3L4FM        0xE0000000
#define ETH_RDES2_L4FM          0x10000000
#define ETH_RDES2_L3FM          0x08000000
#define ETH_RDES2_MADRM         0x07F80000
#define ETH_RDES2_HF            0x00040000
#define ETH_RDES2_DAF           0x00020000
#define ETH_RDES2_SAF           0x00010000
#define ETH_RDES2_VF            0x00008000
#define ETH_RDES2_ARPRN         0x00000400
#define ETH_RDES3_OWN           0x80000000
#define ETH_RDES3_CTXT          0x40000000
#define ETH_RDES3_FD            0x20000000
#define ETH_RDES3_LD            0x10000000
#define ETH_RDES3_RS2V          0x08000000
#define ETH_RDES3_RS1V          0x04000000
#define ETH_RDES3_RS0V          0x02000000
#define ETH_RDES3_CE            0x01000000
#define ETH_RDES3_GP            0x00800000
#define ETH_RDES3_RWT           0x00400000
#define ETH_RDES3_OE            0x00200000
#define ETH_RDES3_RE            0x00100000
#define ETH_RDES3_DE            0x00080000
#define ETH_RDES3_LT            0x00070000
#define ETH_RDES3_ES            0x00008000
#define ETH_RDES3_PL            0x00007FFF

//Receive context descriptor
#define ETH_RDES0_RTSL          0xFFFFFFFF
#define ETH_RDES1_RTSH          0xFFFFFFFF
#define ETH_RDES3_OWN           0x80000000
#define ETH_RDES3_CTXT          0x40000000

//C++ guard
#ifdef __cplusplus
extern "C" {
#endif


/**
 * @brief Transmit descriptor
 **/

typedef struct
{
   uint32_t tdes0;
   uint32_t tdes1;
   uint32_t tdes2;
   uint32_t tdes3;
} F2838xTxDmaDesc;


/**
 * @brief Receive descriptor
 **/

typedef struct
{
   uint32_t rdes0;
   uint32_t rdes1;
   uint32_t rdes2;
   uint32_t rdes3;
} F2838xRxDmaDesc;


//TMS320F2838xD Ethernet MAC driver
extern const NicDriver f2838xEthDriver;

//TMS320F2838xD Ethernet MAC related functions
error_t f2838xEthInit(NetInterface *interface);
void f2838xEthInitGpio(NetInterface *interface);
void f2838xEthInitDmaDesc(NetInterface *interface);

void f2838xEthTick(NetInterface *interface);

void f2838xEthEnableIrq(NetInterface *interface);
void f2838xEthDisableIrq(NetInterface *interface);
void f2838xEthIrqHandler(void);
void f2838xEthEventHandler(NetInterface *interface);

error_t f2838xEthSendPacket(NetInterface *interface,
   const NetBuffer *buffer, size_t offset, NetTxAncillary *ancillary);

error_t f2838xEthReceivePacket(NetInterface *interface);

error_t f2838xEthUpdateMacAddrFilter(NetInterface *interface);
error_t f2838xEthUpdateMacConfig(NetInterface *interface);

void f2838xEthWritePhyReg(uint8_t opcode, uint8_t phyAddr,
   uint8_t regAddr, uint16_t data);

uint16_t f2838xEthReadPhyReg(uint8_t opcode, uint8_t phyAddr,
   uint8_t regAddr);

uint32_t f2838xEthCalcCrc(const void *data, size_t length);

//C++ guard
#ifdef __cplusplus
}
#endif

#endif
